In [1]:
import numpy as np
import pandas as pd

# Transpose

In [2]:
dict={'col' : {'R1':1.2,'R2':2.2}, 'col2':{'R1':3.2,'R2':4.2, 'R3':5.5}}

In [5]:
df=pd.DataFrame(dict)

In [6]:
df

    col  col2
R1  1.2   3.2
R2  2.2   4.2
R3  NaN   5.5

In [8]:
print('Columns ',df.columns)
print('Rows = ',df.index)

Columns  Index(['col', 'col2'], dtype='object')
Rows =  Index(['R1', 'R2', 'R3'], dtype='object')

In [9]:
df_transpose = df.T
df_transpose

       R1   R2   R3
col   1.2  2.2  NaN
col2  3.2  4.2  5.5

In [10]:
print('Columns ',df_transpose.columns)
print('Rows = ',df_transpose.index)

Columns  Index(['R1', 'R2', 'R3'], dtype='object')
Rows =  Index(['col', 'col2'], dtype='object')

# Rearrange columns in specific order

In [11]:
dict= {
    'col1' : [1,2,3,4],
    'col3' : [5,6,7,8],
    'col2' : ['A','B','C','D'],
    'col4' : ['X','Y','Z','D']
}

In [14]:
df = pd.DataFrame(dict)
df

   col1  col3 col2 col4
0     1     5    A    X
1     2     6    B    Y
2     3     7    C    Z
3     4     8    D    D

In [12]:
df = pd.DataFrame(dict, index = ['R1', 'R2', 'R3', 'R4'])
df

    col1  col3 col2 col4
R1     1     5    A    X
R2     2     6    B    Y
R3     3     7    C    Z
R4     4     8    D    D

In [15]:
# Arranging columns
df_order = pd.DataFrame(df, columns=['col1', 'col2', 'col3', 'col4'])
df_order

   col1 col2  col3 col4
0     1    A     5    X
1     2    B     6    Y
2     3    C     7    Z
3     4    D     8    D

# Add update Delete column in DataFrame

In [18]:
df_order['col_5']=0
df_order

   col1 col2  col3 col4  col_5
0     1    A     5    X      0
1     2    B     6    Y      0
2     3    C     7    Z      0
3     4    D     8    D      0

In [19]:
df_orders=pd.DataFrame(df_order, columns=['col0','col1', 'col2', 'col3', 'col4', 'col5'])

In [20]:
df_orders

   col0  col1 col2  col3 col4  col5
0   NaN     1    A     5    X   NaN
1   NaN     2    B     6    Y   NaN
2   NaN     3    C     7    Z   NaN
3   NaN     4    D     8    D   NaN

# update column values

In [22]:
df_orders['col10']=np.arange(4)

In [24]:
df_orders['col0']=np.arange(4)

In [25]:
df_orders

   col0  col1 col2  col3 col4  col5  col10
0     0     1    A     5    X   NaN      0
1     1     2    B     6    Y   NaN      1
2     2     3    C     7    Z   NaN      2
3     3     4    D     8    D   NaN      3

# Update the column value in the dataframe with Series

In [31]:
df = pd.DataFrame(dict, index = ['R1', 'R2', 'R3', 'R4'])
df

    col1  col3 col2 col4
R1     1     5    A    X
R2     2     6    B    Y
R3     3     7    C    Z
R4     4     8    D    D

In [32]:
values = pd.Series([1.8, 1.7], index=['R1', 'R3'])
df['col1'] = values
df

    col1  col3 col2 col4
R1   1.8     5    A    X
R2   NaN     6    B    Y
R3   1.7     7    C    Z
R4   NaN     8    D    D

# Add column with Even Functionality

In [34]:
df['col_even'] = df['col1'] % 2 == 0
df

    col1  col3 col2 col4  col_even
R1   1.8     5    A    X     False
R2   NaN     6    B    Y     False
R3   1.7     7    C    Z     False
R4   NaN     8    D    D     False

In [35]:
del df['col_even']  # Delete COlumns
df

    col1  col3 col2 col4
R1   1.8     5    A    X
R2   NaN     6    B    Y
R3   1.7     7    C    Z
R4   NaN     8    D    D

In [36]:
df.columns

Index(['col1', 'col3', 'col2', 'col4'], dtype='object')

# Adding new column by using map function with a dictonary or function

In [37]:
products = pd.DataFrame(
  {'product':['P1', 'P2','P3'], 'price':[450.,55.66,67.25]}
)
products

  product   price
0      P1  450.00
1      P2   55.66
2      P3   67.25

In [50]:
productCategory = {'P1' : 'C2', 'P2' : 'C3', 'P3' : 'C2' }
productCategory

{'P1': 'C2', 'P2': 'C3', 'P3': 'C2'}

In [47]:
s=pd.Series(productCategory)
s

P1    C2
P2    C3
P3    C2
dtype: object

In [48]:
products['Category']=products['product'].map(productCategory)
products

  product   price Category
0      P1  450.00       C2
1      P2   55.66       C3
2      P3   67.25       C2

# Reindexing rows and columns

In [51]:
df = pd.DataFrame(np.arange(9).reshape((3,3)), index = ('r1', 'r3', 'r4'), columns= ['col1','col3','col4'])
df

    col1  col3  col4
r1     0     1     2
r3     3     4     5
r4     6     7     8

In [53]:
#Method1
df=pd.DataFrame(df,index = ('r1', 'r2','r3', 'r4'), columns= ['col1','col3','col4'])
df

    col1  col3  col4
r1   0.0   1.0   2.0
r2   NaN   NaN   NaN
r3   3.0   4.0   5.0
r4   6.0   7.0   8.0

In [55]:
#Method2
df_rows = pd.DataFrame(np.arange(9).reshape((3,3)), index = ('r1', 'r3', 'r4'), columns= ['col1','col3','col4'])
df_rows

    col1  col3  col4
r1     0     1     2
r3     3     4     5
r4     6     7     8

In [54]:
#Method2
df_rows = df.reindex(['r1', 'r2' ,'r3', 'r4']) 
df_rows

    col1  col3  col4
r1   0.0   1.0   2.0
r2   NaN   NaN   NaN
r3   3.0   4.0   5.0
r4   6.0   7.0   8.0

In [56]:
df_cols = df.reindex(columns=['col1','col2' ,'col3','col4'])
df_cols

    col1  col2  col3  col4
r1   0.0   NaN   1.0   2.0
r2   NaN   NaN   NaN   NaN
r3   3.0   NaN   4.0   5.0
r4   6.0   NaN   7.0   8.0

In [57]:
# BOth cols and rows
df_reindex = df.reindex(index = ['r1', 'r2' ,'r3', 'r4'], columns = ['col1','col2' ,'col3','col4'])
df_reindex

    col1  col2  col3  col4
r1   0.0   NaN   1.0   2.0
r2   NaN   NaN   NaN   NaN
r3   3.0   NaN   4.0   5.0
r4   6.0   NaN   7.0   8.0

In [68]:
# FIlling